In [1]:
! pip install geopy

import geopandas as gpd

Requirement already satisfied: geopy in d:\python-projects\kaggle\foursquare_location_matching\.venv\lib\site-packages (2.2.0)
Requirement already satisfied: geographiclib<2,>=1.49 in d:\python-projects\kaggle\foursquare_location_matching\.venv\lib\site-packages (from geopy) (1.52)

In [3]:
gpd.datasets.available

['naturalearth_cities', 'naturalearth_lowres', 'nybb']

In [4]:
world = gpd.read_file(gpd.datasets.get_path('naturalearth_lowres'))
cities = gpd.read_file(gpd.datasets.get_path('naturalearth_cities'))
nybb = gpd.read_file(gpd.datasets.get_path('nybb'))

In [14]:
world

,pop_est,continent,name,iso_a3,gdp_md_est,geometry
0,920938,Oceania,Fiji,FJI,8374.0,"MULTIPOLYGON (((180.00000 -16.06713, 180.00000..."
1,53950935,Africa,Tanzania,TZA,150600.0,"POLYGON ((33.90371 -0.95000, 34.07262 -1.05982..."
2,603253,Africa,W. Sahara,ESH,906.5,"POLYGON ((-8.66559 27.65643, -8.66512 27.58948..."
3,35623680,North America,Canada,CAN,1674000.0,"MULTIPOLYGON (((-122.84000 49.00000, -122.9742..."
4,326625791,North America,United States of America,USA,18560000.0,"MULTIPOLYGON (((-122.84000 49.00000, -120.0000..."
...,...,...,...,...,...,...
172,7111024,Europe,Serbia,SRB,101800.0,"POLYGON ((18.82982 45.90887, 18.82984 45.90888..."
173,642550,Europe,Montenegro,MNE,10610.0,"POLYGON ((20.07070 42.58863, 19.80161 42.50009..."
174,1895250,Europe,Kosovo,-99,18490.0,"POLYGON ((20.59025 41.85541, 20.52295 42.21787..."
175,1218208,North America,Trinidad and Tobago,TTO,43570.0,"POLYGON ((-61.68000 10.76000, -61.10500 10.890..."
176,13026129,Africa,S. Sudan,SSD,20880.0,"POLYGON ((30.83385 3.50917, 29.95350 4.17370, ..."

In [12]:
cities

             name                     geometry
0    Vatican City    POINT (12.45339 41.90328)
1      San Marino    POINT (12.44177 43.93610)
2           Vaduz     POINT (9.51667 47.13372)
3      Luxembourg     POINT (6.13000 49.61166)
4         Palikir    POINT (158.14997 6.91664)
..            ...                          ...
197         Cairo    POINT (31.24802 30.05191)
198         Tokyo   POINT (139.74946 35.68696)
199         Paris     POINT (2.33139 48.86864)
200      Santiago  POINT (-70.66899 -33.44807)
201     Singapore    POINT (103.85387 1.29498)

[202 rows x 2 columns]

In [20]:
import pandas as pd

df = pd.read_csv('.\\data\\cities15000.txt', delimiter='\t', header=None)
#pd.read_html('.\\data\\cities15000.txt')

In [23]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18], dtype='int64')

In [25]:
df.columns = ['geonameid', 'name', 'asciiname', 'alternatenames', 'latitude', 'longitude', 'feature class', 'feature code', 'country_code', 'cc2', 
            'admin1_code', 'admin2_code', 'admin3_code', 'admin4_code', 'population', 'elevation', 'dem', 'timezone', 'modification_date']

In [27]:
df[df['name'] == 'Moscow']

,geonameid,name,asciiname,alternatenames,latitude,longitude,feature class,feature code,country_code,cc2,admin1_code,admin2_code,admin3_code,admin4_code,population,elevation,dem,timezone,modification_date
19355,524901,Moscow,Moscow,"MOW,Maeskuy,Maskav,Maskava,Maskva,Mat-xco-va,M...",55.75222,37.61556,P,PPLC,RU,NaN,48,NaN,NaN,NaN,10381222,NaN,144,Europe/Moscow,2022-05-05
24799,5601538,Moscow,Moscow,"Hog Heaven,Moscow,Moskou,Moskov,Moskva,Paradis...",46.73239,-117.00017,P,PPLA2,US,NaN,ID,057,NaN,NaN,25060,786.0,788,America/Los_Angeles,2017-03-09

In [29]:
df_15000 = pd.read_csv('.\\data\\cities15000.txt', delimiter='\t', header=None)
df_5000 = pd.read_csv('.\\data\\cities5000.txt', delimiter='\t', header=None)
df_1000 = pd.read_csv('.\\data\\cities1000.txt', delimiter='\t', header=None)
df_500 = pd.read_csv('.\\data\\cities500.txt', delimiter='\t', header=None)
df_all = pd.read_csv('.\\data\\allCountries.txt', delimiter='\t', header=None)

C:\Users\vpe\AppData\Local\Temp\ipykernel_26796\1452634615.py:3: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  df_1000 = pd.read_csv('.\\data\\cities1000.txt', delimiter='\t', header=None)
C:\Users\vpe\AppData\Local\Temp\ipykernel_26796\1452634615.py:4: DtypeWarning: Columns (10,13) have mixed types. Specify dtype option on import or set low_memory=False.
  df_500 = pd.read_csv('.\\data\\cities500.txt', delimiter='\t', header=None)
C:\Users\vpe\AppData\Local\Temp\ipykernel_26796\1452634615.py:5: DtypeWarning: Columns (9,10,11,12,13) have mixed types. Specify dtype option on import or set low_memory=False.
  df_all = pd.read_csv('.\\data\\allCountries.txt', delimiter='\t', header=None)

In [31]:
print(f'Shape of df_15000 is {df_15000.shape}, \nShape of df_5000 is {df_5000.shape}, \nShape of df_1000 is {df_1000.shape}, \nShape of df_500 is {df_500.shape}, \n')
print (f'Shape of complete df is {df_all.shape}')
print(f'sum of all cities dfs is {df_15000.shape[0] + df_5000.shape[0] + df_1000.shape[0] + df_500.shape[0]}')

Shape of df_15000 is (25859, 19),
Shape of df_5000 is (52402, 19),
Shape of df_1000 is (140041, 19),
Shape of df_500 is (198849, 19),

Shape of complete df is (12344518, 19)
sum of all cities dfs is 417151

In [32]:
df_all.columns = ['geonameid', 'name', 'asciiname', 'alternatenames', 'latitude', 'longitude', 'feature class', 'feature code', 'country_code', 'cc2', 
            'admin1_code', 'admin2_code', 'admin3_code', 'admin4_code', 'population', 'elevation', 'dem', 'timezone', 'modification_date']

In [34]:
df_all[df_all['name'] == 'Hengelo']

,geonameid,name,asciiname,alternatenames,latitude,longitude,feature class,feature code,country_code,cc2,admin1_code,admin2_code,admin3_code,admin4_code,population,elevation,dem,timezone,modification_date
6926653,2754394,Hengelo,Hengelo,"Hemgelo,Hengelo,Hengeloo,QYH",52.26583,6.79306,P,PPLA2,NL,NaN,15.0,164.0,NaN,NaN,80809,NaN,18,Europe/Amsterdam,2018-10-18
6926654,2754395,Hengelo,Hengelo,"Hengelo (Gld),Hengeloo",52.05083,6.30972,P,PPL,NL,NaN,3.0,1876.0,NaN,NaN,4510,NaN,16,Europe/Amsterdam,2017-10-09

In [4]:
df = gpd.tools.geocode(  
        ["boston, ma", "1600 pennsylvania ave. washington, dc"]
    )
df

,geometry,address
0,POINT (-71.05829 42.36025),"Boston, 02102, Boston, Massachusetts, United S..."
1,POINT (-77.03655 38.89770),"White House, 1600, Pennsylvania Avenue Northwe..."

In [5]:
from shapely.geometry import Point

In [10]:
gpd.tools.reverse_geocode(  
    [Point(-71.05829, 42.36025), Point(-77.03655, 38.89770)])

,geometry,address
0,POINT (-71.05829 42.36025),"Boston, 02102, Boston, Massachusetts, United S..."
1,POINT (-77.03655 38.89770),"White House, 1600, Pennsylvania Avenue Northwe..."

In [15]:
df = gpd.tools.reverse_geocode(  
    [Point(3.6341963487748346, 50.85997533509319)]
)
df

                   geometry                                            address
0  POINT (3.63421 50.85996)  Abdijstraat, 9700, Oudenaarde, Oost-Vlaanderen...

In [13]:
gpd.tools.geocode(  
        ["Cossebauder Str. 6,Dresden-Cotta,Sachsen,01157,DE"]
    )

,geometry,address
0,POINT (13.68094 51.06071),"Lidl, 6, Cossebauder StraÃŸe, 01157, Cossebaude..."

In [1]:
import pandas as pd

In [2]:
df_pairs = pd.read_csv('.\\data\\pairs_custom.csv')

C:\Users\vpe\AppData\Local\Temp\ipykernel_7780\1072369920.py:1: DtypeWarning: Columns (18,19,21,22) have mixed types. Specify dtype option on import or set low_memory=False.
  df_pairs = pd.read_csv('.\\data\\pairs_custom.csv')

In [3]:
df_pairs.head()

,id_1,name_1,latitude_1,longitude_1,address_1,city_1,state_1,zip_1,country_1,url_1,...,longitude_2,address_2,city_2,state_2,zip_2,country_2,url_2,phone_2,categories_2,match
0,E_9c455c75918751,Manjabal 2,-6.712090,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,...,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,NaN,Indonesian Restaurants,True
1,E_f96f973047a099,RÃ¼stem PaÅŸa (Ulu) Camii,40.359018,30.012008,Camikebir Mh. Sakarya Cd.,Osmaneli,Bilecik,NaN,TR,NaN,...,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,NaN,Indonesian Restaurants,False
2,E_b16dafc319e90a,Starbucks,27.870459,-82.761560,10809 Starkey Rd,Largo,FL,33777,US,http://www.starbucks.com/store/1018298,...,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,NaN,Indonesian Restaurants,False
3,E_0be920c4d49631,Refter Sint Tarcisiusinstituut,50.832716,5.102211,NaN,NaN,NaN,NaN,BE,NaN,...,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,NaN,Indonesian Restaurants,False
4,E_10d09c32c73bb3,Wetherspoon Express,51.890014,0.262341,"Satellite 2, near Gate 31",Stansted,Essex,CM24 1QW,GB,http://www.jdwetherspoon.co.uk,...,108.561016,Jalan Karanggetas,Cirebon,Jawa Barat,NaN,ID,NaN,NaN,Indonesian Restaurants,False